backend-pursuit-of-pokeness/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "vanessa"], ["LIMIT", 1]]
---
	def create
	  @user = User.find_by(name: user_login_params[:name])