backend-pursuit-of-pokeness/app/controllers/poke_users_controller.rb

SELECT "poke_users".* FROM "poke_users"
---
    def index
        @poke_users = PokeUser.all

INSERT INTO "poke_users" ("user_id", "pokemon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["pokemon_id", 169], ["created_at", "2019-03-04 21:25:24.751472"], ["updated_at", "2019-03-04 21:25:24.751472"]]
---
    def create
        @poke_user = PokeUser.new(poke_user_params)
        if @poke_user.save