backend-pursuit-of-pokeness/app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "poke_users".* FROM "poke_users" WHERE "poke_users"."user_id" = $1  [["user_id", 1]]

    def create
        @user = User.new(user_params)
        if @user.save
            @token = encode_token(user_id: @user.id)
            @user.pokemons << Pokemon.all[0]
---
INSERT INTO "poke_users" ("user_id", "pokemon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["pokemon_id", 1], ["created_at", "2019-03-05 19:56:42.574787"], ["updated_at", "2019-03-05 19:56:42.574787"]]
INSERT INTO "users" ("name", "image", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "pokemons".* FROM "pokemons"